panStamp/panstamp/arduino-1.5/arduino-1.5_patch/win/tools/msp430/msp430/include/msp430f2491.h
#define WDTCTL_               0x0120    /* Watchdog Timer Control */
sfrw(WDTCTL, WDTCTL_);
/* The bit names have been prefixed with "WDT" */
#define WDTIS0              (0x0001)
#define WDTIS1              (0x0002)
#define WDTSSEL             (0x0004)
#define WDTCNTCL            (0x0008)
#define WDTTMSEL            (0x0010)
#define WDTNMI              (0x0020)
#define WDTNMIES            (0x0040)
#define WDTHOLD             (0x0080)

#define WDTPW               (0x5A00)

/* WDT-interval times [1ms] coded with Bits 0-2 */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MDLY_32         (WDTPW+WDTTMSEL+WDTCNTCL)                         /* 32ms interval (default) */
#define WDT_MDLY_8          (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS0)                  /* 8ms     " */
#define WDT_MDLY_0_5        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1)                  /* 0.5ms   " */
#define WDT_MDLY_0_064      (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1+WDTIS0)           /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ADLY_1000       (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL)                 /* 1000ms  " */
#define WDT_ADLY_250        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS0)          /* 250ms   " */
#define WDT_ADLY_16         (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1)          /* 16ms    " */
#define WDT_ADLY_1_9        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)   /* 1.9ms   " */
/* Watchdog mode -> reset after expired time */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MRST_32         (WDTPW+WDTCNTCL)                                  /* 32ms interval (default) */
#define WDT_MRST_8          (WDTPW+WDTCNTCL+WDTIS0)                           /* 8ms     " */
#define WDT_MRST_0_5        (WDTPW+WDTCNTCL+WDTIS1)                           /* 0.5ms   " */
#define WDT_MRST_0_064      (WDTPW+WDTCNTCL+WDTIS1+WDTIS0)                    /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ARST_1000       (WDTPW+WDTCNTCL+WDTSSEL)                          /* 1000ms  " */
#define WDT_ARST_250        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS0)                   /* 250ms   " */
#define WDT_ARST_16         (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1)                   /* 16ms    " */
#define WDT_ARST_1_9        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)            /* 1.9ms   " */

/* INTERRUPT CONTROL */
/* These two bits are defined in the Special Function Registers */
/* #define WDTIE               0x01 */
/* #define WDTIFG              0x01 */

/************************************************************
* Calibration Data in Info Mem
************************************************************/

/* TLV Calibration Data Structure */
#define TAG_DCO_30             (0x01)    /* Tag for DCO30  Calibration Data */
#define TAG_EMPTY              (0xFE)    /* Tag for Empty Data Field in Calibration Data */

#ifndef __DisableCalData
#define TLV_CHECKSUM_         0x10C0    /* TLV CHECK SUM */
const_sfrw(TLV_CHECKSUM, TLV_CHECKSUM_);
#define TLV_DCO_30_TAG_       0x10F6    /* TLV TAG_DCO30 TAG */
const_sfrb(TLV_DCO_30_TAG, TLV_DCO_30_TAG_);
#define TLV_DCO_30_LEN_       0x10F7    /* TLV TAG_DCO30 LEN */
const_sfrb(TLV_DCO_30_LEN, TLV_DCO_30_LEN_);
#endif

#define CAL_DCO_16MHZ          (0x0000)  /* Index for DCOCTL  Calibration Data for 16MHz */
#define CAL_BC1_16MHZ          (0x0001)  /* Index for BCSCTL1 Calibration Data for 16MHz */
#define CAL_DCO_12MHZ          (0x0002)  /* Index for DCOCTL  Calibration Data for 12MHz */
#define CAL_BC1_12MHZ          (0x0003)  /* Index for BCSCTL1 Calibration Data for 12MHz */
#define CAL_DCO_8MHZ           (0x0004)  /* Index for DCOCTL  Calibration Data for 8MHz */
#define CAL_BC1_8MHZ           (0x0005)  /* Index for BCSCTL1 Calibration Data for 8MHz */
#define CAL_DCO_1MHZ           (0x0006)  /* Index for DCOCTL  Calibration Data for 1MHz */
#define CAL_BC1_1MHZ           (0x0007)  /* Index for BCSCTL1 Calibration Data for 1MHz */


/************************************************************
* Calibration Data in Info Mem
************************************************************/

#ifndef __DisableCalData

#define CALDCO_16MHZ_         0x10F8    /* DCOCTL  Calibration Data for 16MHz */
const_sfrb(CALDCO_16MHZ, CALDCO_16MHZ_);
#define CALBC1_16MHZ_         0x10F9    /* BCSCTL1 Calibration Data for 16MHz */
const_sfrb(CALBC1_16MHZ, CALBC1_16MHZ_);
#define CALDCO_12MHZ_         0x10FA    /* DCOCTL  Calibration Data for 12MHz */
const_sfrb(CALDCO_12MHZ, CALDCO_12MHZ_);
#define CALBC1_12MHZ_         0x10FB    /* BCSCTL1 Calibration Data for 12MHz */
const_sfrb(CALBC1_12MHZ, CALBC1_12MHZ_);
#define CALDCO_8MHZ_          0x10FC    /* DCOCTL  Calibration Data for 8MHz */
const_sfrb(CALDCO_8MHZ, CALDCO_8MHZ_);
#define CALBC1_8MHZ_          0x10FD    /* BCSCTL1 Calibration Data for 8MHz */
const_sfrb(CALBC1_8MHZ, CALBC1_8MHZ_);
#define CALDCO_1MHZ_          0x10FE    /* DCOCTL  Calibration Data for 1MHz */
const_sfrb(CALDCO_1MHZ, CALDCO_1MHZ_);
#define CALBC1_1MHZ_          0x10FF    /* BCSCTL1 Calibration Data for 1MHz */
const_sfrb(CALBC1_1MHZ, CALBC1_1MHZ_);

#endif /* #ifndef __DisableCalData */

/************************************************************
* Interrupt Vectors (offset from 0xFFC0)
************************************************************/

#define RESERVED0_VECTOR    (0x0000)  /* 0xFFC0 Reserved Int. Vector 0 */
#define RESERVED1_VECTOR    (0x0002)  /* 0xFFC2 Reserved Int. Vector 1 */
#define RESERVED2_VECTOR    (0x0004)  /* 0xFFC4 Reserved Int. Vector 2 */
#define RESERVED3_VECTOR    (0x0006)  /* 0xFFC6 Reserved Int. Vector 3 */
#define RESERVED4_VECTOR    (0x0008)  /* 0xFFC8 Reserved Int. Vector 4 */
#define RESERVED5_VECTOR    (0x000A)  /* 0xFFCA Reserved Int. Vector 5 */
#define RESERVED6_VECTOR    (0x000C)  /* 0xFFCC Reserved Int. Vector 6 */
#define RESERVED7_VECTOR    (0x000E)  /* 0xFFCE Reserved Int. Vector 7 */
#define RESERVED8_VECTOR    (0x0010)  /* 0xFFD0 Reserved Int. Vector 8 */
#define RESERVED9_VECTOR    (0x0012)  /* 0xFFD2 Reserved Int. Vector 9 */
#define RESERVED10_VECTOR   (0x0014) /* 0xFFD4 Reserved Int. Vector 10 */
#define RESERVED11_VECTOR   (0x0016) /* 0xFFD6 Reserved Int. Vector 11 */
#define RESERVED12_VECTOR   (0x0018) /* 0xFFD8 Reserved Int. Vector 12 */
#define RESERVED13_VECTOR   (0x001A) /* 0xFFDA Reserved Int. Vector 13 */
#define RESERVED14_VECTOR   (0x001C) /* 0xFFDC Reserved Int. Vector 14 */
#define RESERVED15_VECTOR   (0x001E) /* 0xFFDE Reserved Int. Vector 15 */
#define USCIAB1TX_VECTOR    (0x0020) /* 0xFFE0 USCI A1/B1 Transmit */
#define USCIAB1RX_VECTOR    (0x0022) /* 0xFFE2 USCI A1/B1 Receive */
#define PORT1_VECTOR        (0x0024) /* 0xFFE4 Port 1 */
#define PORT2_VECTOR        (0x0026) /* 0xFFE6 Port 2 */
#define RESERVED20_VECTOR   (0x0028) /* 0xFFE8 Reserved Int. Vector 20 */
#define RESERVED21_VECTOR   (0x002A) /* 0xFFEA Reserved Int. Vector 21 */
#define USCIAB0TX_VECTOR    (0x002C) /* 0xFFEC USCI A0/B0 Transmit */
#define USCIAB0RX_VECTOR    (0x002E) /* 0xFFEE USCI A0/B0 Receive */
#define TIMERA1_VECTOR      (0x0030) /* 0xFFF0 Timer A CC1-2, TA */
#define TIMERA0_VECTOR      (0x0032) /* 0xFFF2 Timer A CC0 */
#define WDT_VECTOR          (0x0034) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (0x0036) /* 0xFFF6 Comparator A */
#define TIMERB1_VECTOR      (0x0038) /* 0xFFF8 Timer B CC1-6, TB */
#define TIMERB0_VECTOR      (0x003A) /* 0xFFFA Timer B CC0 */
#define NMI_VECTOR          (0x003C) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (0x003E) /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430x24x1 */

